In [2]:
def limpiar(cadena):
    return ''.join([i for i in cadena if not i.isdigit()])

limpiar('juan32')

'juan'

In [10]:
import pandas as pd

nombres = ['juan32', 'man34uel', 'pedro25', '42ana']
documentos = [1,2,3,4]


df = pd.DataFrame(
    {
        'docs': documentos,
        'nombres': nombres
    }
)

df

   docs   nombres
0     1    juan32
1     2  man34uel
2     3   pedro25
3     4     42ana

In [11]:
df['nombres']=df['nombres'].map(
    lambda x: limpiar(x)
)

In [12]:
df

   docs nombres
0     1    juan
1     2  manuel
2     3   pedro
3     4     ana